package com.epam.khalii.Task2;

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
/**
Ввести n чисел с консоли.
1. Найти самое короткое и самое длинное число. Вывести найденные числа и их длину.
2. Упорядочить и вывести числа в порядке возрастания (убывания) значений их длины.
3. Вывести на консоль те числа, длина которых меньше (больше) средней, а также длину.
4. Найти число, в котором число различных цифр минимально. Если таких чисел несколько,
 найти первое из них.
5. Найти количество чисел, содержащих только четные цифры, а среди них количество чисел
 с равным числом четных и нечетных цифр.
6. Найти число, цифры в котором идут в строгом порядке возрастания. Если таких чисел
 несколько, найти первое из них.
7. Найти число, состоящее только из различных цифр. Если таких чисел несколько, найти
 первое из них.
8. Вывести числа от 1 до k в виде матрицы N x N слева направо и сверху вниз.

9.Ввести с консоли n-размерность матрицы a [n] [n]. Задать значения элементов матрицы
 в интервале значений от -n до n с помощью датчика случайных чисел.
9.1. Упорядочить строки (столбцы) матрицы в порядке возрастания значений.
9.2. Выполнить циклический сдвиг заданной матрицы на k позиций вправо(влево, вверх, вниз).
9.3. Найти и вывести наибольшее число возрастающих (убывающих) элементов матрицы, идущих
 подряд.
9.4. Найти сумму элементов матрицы, расположенных между первым и вторым положительными
 элементами каждой строки.
9.5. Повернуть матрицу на 90 (180, 270) градусов против часовой стрелки.
9.6 Построить матрицу, вычитая из элементов каждой строки матрицы ее среднее арифметическое.
9.7. Уплотнить матрицу, удаляя из нее строки и столбцы, заполненные нулями.
9.8. Преобразовать строки матрицы таким образом, чтобы элементы, равные нулю,
 располагались после всех остальных.

 */